
// ++ Соколовская О.В. 13.09.2026 Работа с телеграм-ботом  	  	
Процедура ВКМ_ОтправкаСообщений() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_УведомленияТелеграмБоту.Ссылка КАК Ссылка,
		|	ВКМ_УведомленияТелеграмБоту.ТекстСообщения КАК ТекстСообщения
		|ИЗ
		|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();
			Соединение = Новый HTTPСоединение("api.telegram.org", 443,,,,,ЗащищенноеСоединение);
			
			Запрос = Новый HTTPЗапрос("/bot" + TokenTelegramm() + "/sendMessage");
			Запрос.Заголовки.Вставить("Content-Type", "application/json");
			
			Данные = Новый Структура;
			Данные.Вставить("chat_id", ИдентификаторГруппы());
			Данные.Вставить("text", Выборка.ТекстСообщения);
			
			ЗаписьJSON = Новый ЗаписьJSON;
			ЗаписьJSON.УстановитьСтроку();
			ЗаписатьJSON(ЗаписьJSON, Данные);
			ТелоЗапроса = ЗаписьJSON.Закрыть();
			
			Запрос.УстановитьТелоИзСтроки(ТелоЗапроса, КодировкаТекста.UTF8);
			
			Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос);
			
			Если Ответ.КодСостояния = 200 тогда
				Сообщить("Успешно");
				СправочникУведомлениеОбъект = Выборка.Ссылка.ПолучитьОбъект();
				СправочникУведомлениеОбъект.Удалить();
			Иначе
				Сообщение = Ответ.ПолучитьТелоКакСтроку();
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при отправке сообщения'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка, , , Сообщение);
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // -- Соколовская О.В. 13.09.2026

// ++ Соколовская О.В. 13.09.2026 Работа с телеграм-ботом
Функция TokenTelegramm() 

	Токен = Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить();
	
	Если ПустаяСтрока(Токен) Тогда
		Возврат "";
	Иначе
		Возврат Токен;
	КонецЕсли;
	
	
КонецФункции // -- Соколовская О.В. 13.09.2026

// ++ Соколовская О.В. 13.09.2026 Работа с телеграм-ботом
Функция ИдентификаторГруппы() 

	ИдентификаторГруппы = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить();
	
	Если ПустаяСтрока(ИдентификаторГруппы) Тогда
		Возврат "";
	Иначе
		Возврат ИдентификаторГруппы;
	КонецЕсли;
	
	
КонецФункции // -- Соколовская О.В. 13.09.2026




