#language: ru

@tree

Функционал: Массовое создание актов

Как Бухгалтер я хочу
массово формировать акты по всем абонентским договорам 
чтобы не вводить их вручную, а так же не пропустить договора, по которым не было оказано работ, 
но необходимо проконтролировать оплату ежемесячного обслуживания    

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий
	И я закрываю все окна клиентского приложения

Сценарий: Массовое создание актов
	И В командном интерфейсе я выбираю "Добавленные объекты" "Массовое создание актов (вкм)"
	Тогда открылось окно "Массовое создание актов (вкм)"
	И я нажимаю кнопку выбора у поля с именем 'Период'
	И в поле с именем 'Период' я ввожу текст "01.11.2026"
	И я нажимаю на кнопку с именем 'Заполнить'
	И Я закрываю окно "Массовое создание актов (вкм)"
	

	
