#language: ru

@tree

Функционал: Ввод нескольких обслуживаний клиентов (вкм)

Как Менеджер я хочу
ввести в систему документ Обслуживание клиентов 
чтобы спланировать работы специалистов    

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий
	И я закрываю все окна клиентского приложения

Структура сценария: Ввод нескольких обслуживаний клиентов (вкм)
	* Создание Обслуживание клиентов (вкм)
		Когда В панели разделов я выбираю "Добавленные объекты"
		И Я нажимаю кнопку командного интерфейса "Обслуживание клиентов (вкм)"
		Тогда открылось окно "Обслуживание клиентов (вкм)"
		И я нажимаю на кнопку с именем 'ФормаСоздать'
		Тогда открылось окно "Обслуживание клиентов (вкм) (создание)"
	* Заполнение шапки документа
		* Заполнение специалиста
			И я нажимаю кнопку выбора у поля с именем 'Специалист'
			Тогда открылось окно "Выбор пользователя"
			Если в таблице "ПользователиСписок" нет строки Тогда
				| 'Полное имя'       |
				| '<ИмяСпециалиста>' |
				И в таблице 'ПользователиСписок' я перехожу к строке:
					| "Полное имя"    |
					| "Администратор" |
				Тогда открылось окно "Выбор пользователя"
			И в таблице 'ПользователиСписок' я выбираю текущую строку
		* Заполнение клиента			
			И я нажимаю кнопку выбора у поля с именем 'Клиент'
			Тогда открылось окно "Контрагенты"
			Если в таблице "Список" нет строки Тогда
				| 'Наименование'              |
				| '<НаименованиеКонтрагента>' |
				И я нажимаю на кнопку с именем 'ФормаСоздать'
				Тогда открылось окно "Контрагент (создание)"
				И в поле с именем 'Наименование' я ввожу текст <НаименованиеКонтрагента>
				И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
				И я жду закрытия окна "Контрагент (создание) *" в течение 20 секунд
				Тогда открылось окно "Контрагенты"
			И в таблице 'Список' я выбираю текущую строку
		* Заполнение договора
			И я нажимаю кнопку выбора у поля с именем 'Договор'
			Тогда открылось окно "Договоры контрагентов"
			Если в таблице "Список" нет строки Тогда
				| 'Наименование'       |
				| '<НазваниеДоговора>' |
				И я нажимаю на кнопку с именем 'ФормаСоздать'
				Тогда открылось окно "Договор контрагента (создание)"
				И в поле с именем 'Наименование' я ввожу текст <НазваниеДоговора>
				И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
				И я жду закрытия окна "Договор контрагента (создание) *" в течение 20 секунд
				Тогда открылось окно "Договоры контрагентов"
			И в таблице 'Список' я выбираю текущую строку
		* Заполнение даты проведения работ
			Тогда открылось окно "Обслуживание клиентов (вкм) *"
			И в поле с именем'ДатаПроведенияРабот' я ввожу текст "05.10.2026"
			И я перехожу к следующему реквизиту
		* Заполнение время проведения работ		
			И в поле с именем 'ВремяНачалаРаботПлан' я ввожу текст "13:00:00"
			И я перехожу к следующему реквизиту
			И в поле с именем 'ВремяОкончанияРаботПлан' я ввожу текст "15:00:00"
			И я перехожу к следующему реквизиту
		* Заполнение описания проблемы
		И в поле с именем 'ОписаниеПроблемы' я ввожу текст "Необходимо обучение пользователей"
	* Заполнение табличной части Выполненные работы
		И в таблице 'ВыполненныеРаботы' я нажимаю на кнопку с именем 'ВыполненныеРаботыДобавить'
		И в таблице 'ВыполненныеРаботы' в поле с именем 'ВыполненныеРаботыОписаниеРабот' я ввожу текст "Обучение пользователей"
		И в таблице 'ВыполненныеРаботы' я завершаю редактирование строки
	* Запись документа
		И я нажимаю на кнопку с именем 'ФормаЗаписать'
		И я закрываю текущее окно

Примеры: 
	| 'ИмяСпециалиста' | 'НаименованиеКонтрагента' | 'НазваниеДоговора' |
	| 'Специалист 1'   | 'Красный октябрь'         | 'Договор 1'        |
	| 'Специалист 2'   | 'Красный пролетарий'      | 'Договор 5'        |
	| 'Специалист 3'   | 'ООО Ромашка'             | 'Договор Ромашка'  |






		