#language: ru

@tree

Функционал: Формирование отчёта Анализ выставленных актов

Как Бухгалтер я хочу
Формировать отчет Анализ выставленных актов 
чтобы анализировать информацию о клиентах, договорах и суммах, 
которые должны быть выставлены клиентам на основе данных из документов Обслуживание клиентов   

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий
	И я закрываю все окна клиентского приложения

Сценарий: Формирование отчёта Анализ выставленных актов
И В командном интерфейсе я выбираю "Добавленные объекты" "Анализ выставленных актов (вкм)"
Тогда открылось окно "Анализ выставленных актов"
И я нажимаю кнопку выбора у поля с именем 'Период1ДатаНачала'
И в поле с именем 'Период1ДатаНачала' я ввожу текст "01.10.2026"
И я перехожу к следующему реквизиту
И в поле с именем 'Период1ДатаОкончания' я ввожу текст "30.11.2026"
И я нажимаю на кнопку с именем 'СформироватьОтчет'




