
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// ++ Соколовская О.В. 19.09.2026 Начисление премии
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	ПараметрНДФЛ = ВКМ_РасчетНДФЛ.ПараметрНДФЛ();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(ВКМ_НачислениеФиксированныхПремийНачислениеПремии.Ссылка.Дата, МЕСЯЦ) КАК ПериодРегистрации,
		|	ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ДополнительныеНачисления.ФиксированнаяПремия) КАК ВидРасчета,
		|	ВКМ_НачислениеФиксированныхПремийНачислениеПремии.Сотрудник КАК Сотрудник,
		|	ВКМ_НачислениеФиксированныхПремийНачислениеПремии.СуммаПремии * &ПараметрНДФЛ КАК Сумма
		|ИЗ
		|	Документ.ВКМ_НачислениеФиксированныхПремий.НачислениеПремии КАК ВКМ_НачислениеФиксированныхПремийНачислениеПремии
		|ГДЕ
		|	ВКМ_НачислениеФиксированныхПремийНачислениеПремии.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ПараметрНДФЛ", ПараметрНДФЛ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.ДобавитьПриход();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		Движение.Период = Дата;
	КонецЦикла;
	// -- Соколовская О.В. 13.09.2026

КонецПроцедуры

#КонецОбласти
