
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// ++ Соколовская О.В. 19.09.2026 Начисление зарплаты
	Движения.ВКМ_ОсновныеНачисления.Записывать = Истина;
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	Движения.ВКМ_Удержания.Записывать = Истина;
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	ВидРасчетаОтпуск = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск;
	ВидРасчетаОклад = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад;
	ВидРасчетаПремия = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ФиксированнаяПремия;
	ВидРасчетаПроцентЗаВыполненныеРаботы = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ПроцентЗаВыполненныеРаботы;
	
	ПараметрНДФЛ = ВКМ_РасчетНДФЛ.ПараметрНДФЛ();
	
	// Подготовка движений для расчета основных начислений
	ЗаписатьОсновныеНачисления(ВидРасчетаОтпуск);
	
	// Создание таблицы для накопления суммы по сотруднику для формирования движений по регистру "Взаиморасчеты с сотрудниками"
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Период", Новый ОписаниеТипов(,,,,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ТЗ.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	ТЗ.Колонки.Добавить("Сумма", Новый ОписаниеТипов(,,, Новый КвалификаторыЧисла(15, 2)));
	
	// Расчет оклада
	РасчетОклада(ВидРасчетаОклад, ПараметрНДФЛ, ТЗ);
	
	// Расчета отпуска
	РасчетОтпуска(ВидРасчетаОтпуск, ПараметрНДФЛ, ТЗ);

	// Расчет процента за выполненные работы
	РасчетПроцентаЗаВыполненныеРаботы(ВидРасчетаПремия, ВидРасчетаПроцентЗаВыполненныеРаботы, ПараметрНДФЛ, ТЗ);
	
	// Расчет удержаний
	РасчетУдержаний(ПараметрНДФЛ, ТЗ);
	
	ТЗ.Свернуть("Сотрудник, Период", "Сумма");
	Для Каждого Стр Из ТЗ Цикл
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.ДобавитьПриход();
		ЗаполнитьЗначенияСвойств(Движение, Стр);
	КонецЦикла;
	// -- Соколовская О.В. 19.09.2026
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// ++ Соколовская О.В. 19.09.2026 Начисление зарплаты
Процедура ЗаписатьОсновныеНачисления(Знач ВидРасчетаОтпуск)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления.Ссылка.Дата, МЕСЯЦ) КАК ПериодРегистрации,
	|	ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления.ДатаНачала КАК ПериодДействияНачало,
	|	КОНЕЦПЕРИОДА(ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления.ДатаОкончания, ДЕНЬ) КАК ПериодДействияКонец,
	|	ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления.Сотрудник КАК Сотрудник,
	|	ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления.ВидРасчета КАК ВидРасчета
	|ИЗ
	|	Документ.ВКМ_НачислениеЗаработнойПлаты.ОсновныеНачисления КАК ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления
	|ГДЕ
	|	ВКМ_НачислениеЗаработнойПлатыОсновныеНачисления.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		Если Движение.ВидРасчета = ВидРасчетаОтпуск Тогда
			Движение.БазовыйПериодНачало = ДобавитьМесяц(Выборка.ПериодРегистрации, -12);
			Движение.БазовыйПериодКонец = Выборка.ПериодРегистрации - 1;
		КонецЕсли;
	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать();
	
КонецПроцедуры // -- Соколовская О.В. 19.09.2026

// ++ Соколовская О.В. 19.09.2026 Начисление зарплаты
Процедура РасчетОклада(ВидРасчетаОклад, Знач ПараметрНДФЛ, ТЗ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник КАК Сотрудник,
	|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия, 0) КАК ЧасовПлан,
	|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК ЧасовФакт
	|ПОМЕСТИТЬ втДанныеГрафика
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(
	|			Регистратор = &Ссылка
	|				И ВидРасчета = &ВидРасчетаОклад) КАК ВКМ_ОсновныеНачисленияДанныеГрафика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДанныеГрафика.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудникамСрезПоследних.Оклад, 0) КАК Оклад,
	|	втДанныеГрафика.ЧасовПлан КАК ЧасовПлан,
	|	втДанныеГрафика.ЧасовФакт КАК ЧасовФакт
	|ИЗ
	|	втДанныеГрафика КАК втДанныеГрафика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудникам.СрезПоследних(
	|				&Дата,
	|				Сотрудник В
	|					(ВЫБРАТЬ
	|						втДанныеГрафика.Сотрудник КАК Сотрудник
	|					ИЗ
	|						втДанныеГрафика КАК втДанныеГрафика)) КАК ВКМ_УсловияОплатыСотрудникамСрезПоследних
	|		ПО втДанныеГрафика.Сотрудник = ВКМ_УсловияОплатыСотрудникамСрезПоследних.Сотрудник";
	
	Запрос.УстановитьПараметр("ВидРасчетаОклад", ВидРасчетаОклад);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ВКМ_ОсновныеНачисления[Выборка.НомерСтроки - 1];
		СуммаБезУчетаНДФЛ = ?(Выборка.ЧасовПлан <> 0, Выборка.Оклад * Выборка.ЧасовФакт / Выборка.ЧасовПлан, 0);
		Движение.Сумма = СуммаБезУчетаНДФЛ * ПараметрНДФЛ;
		Движение.Дней = Выборка.ЧасовПлан / 8;
		
		Стр = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(Стр, Движение, "Сотрудник, Сумма");
		Стр.Период = Дата;
	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать(, Истина);

КонецПроцедуры // -- Соколовская О.В. 19.09.2026

// ++ Соколовская О.В. 19.09.2026 Начисление зарплаты
Процедура РасчетОтпуска(Знач ВидРасчетаОтпуск, Знач ПараметрНДФЛ, ТЗ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РАЗНОСТЬДАТ(ВКМ_ОсновныеНачисленияДанныеГрафика.ПериодДействияНачало, ВКМ_ОсновныеНачисленияДанныеГрафика.ПериодДействияКонец, ДЕНЬ) КАК КалендарныхДней,
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ втДанныеГрафикаОтпуска
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(
	|			Регистратор = &Ссылка
	|				И ВидРасчета = &ВидРасчетаОтпуск) КАК ВКМ_ОсновныеНачисленияДанныеГрафика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДанныеГрафикаОтпуска.НомерСтроки КАК НомерСтроки,
	|	втДанныеГрафикаОтпуска.КалендарныхДней КАК КалендарныхДней,
	|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.СуммаБаза, 0) КАК СуммаБаза,
	|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.ДнейБаза, 0) КАК ДнейБаза
	|ИЗ
	|	втДанныеГрафикаОтпуска КАК втДанныеГрафикаОтпуска
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ОсновныеНачисления(
	|				&Измерения,
	|				&Измерения,
	|				,
	|				Регистратор = &Ссылка
	|					И ВидРасчета = &ВидРасчетаОтпуск) КАК ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления
	|		ПО втДанныеГрафикаОтпуска.НомерСтроки = ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.НомерСтроки";
	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");
	
	Запрос.УстановитьПараметр("ВидРасчетаОтпуск", ВидРасчетаОтпуск);
	Запрос.УстановитьПараметр("Измерения", Измерения);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ВКМ_ОсновныеНачисления[Выборка.НомерСтроки - 1];
		СуммаБезУчетаНДФЛ = ?(Выборка.ДнейБаза <> 0, Выборка.СуммаБаза / Выборка.ДнейБаза * Выборка.КалендарныхДней, 0);
		Движение.Сумма = СуммаБезУчетаНДФЛ * ПараметрНДФЛ;
		
		Стр = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(Стр, Движение, "Сотрудник, Сумма");
		Стр.Период = Дата;
	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать(, Истина);

КонецПроцедуры // -- Соколовская О.В. 19.09.2026

// ++ Соколовская О.В. 19.09.2026 Начисление зарплаты
Процедура РасчетПроцентаЗаВыполненныеРаботы(Знач ВидРасчетаПремия, Знач ВидРасчетаПроцентЗаВыполненныеРаботы, Знач ПараметрНДФЛ, ТЗ)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВКМ_НачислениеЗаработнойПлатыДополнительныеНачисления.Ссылка.Дата, МЕСЯЦ) КАК ПериодРегистрации,
	|	ВКМ_НачислениеЗаработнойПлатыДополнительныеНачисления.Сотрудник КАК Сотрудник,
	|	ВКМ_НачислениеЗаработнойПлатыДополнительныеНачисления.ВидРасчета КАК ВидРасчета
	|ПОМЕСТИТЬ втДопНачисления
	|ИЗ
	|	Документ.ВКМ_НачислениеЗаработнойПлаты.ДополнительныеНачисления КАК ВКМ_НачислениеЗаработнойПлатыДополнительныеНачисления
	|ГДЕ
	|	ВКМ_НачислениеЗаработнойПлатыДополнительныеНачисления.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник КАК Сотрудник,
	|	ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеОборот КАК СуммаКОплатеОборот
	|ПОМЕСТИТЬ втВыполненныеРаботы
	|ИЗ
	|	РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(
	|			&НачалоМесяца,
	|			&КонецМесяца,
	|			,
	|			Сотрудник В
	|				(ВЫБРАТЬ
	|					втДопНачисления.Сотрудник КАК Сотрудник
	|				ИЗ
	|					втДопНачисления КАК втДопНачисления)) КАК ВКМ_ВыполненныеСотрудникомРаботыОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудникамСрезПоследних.Сотрудник КАК Сотрудник,
	|	ВКМ_УсловияОплатыСотрудникамСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот
	|ПОМЕСТИТЬ втПроцентОтРабот
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудникам.СрезПоследних(
	|			&Дата,
	|			Сотрудник В
	|				(ВЫБРАТЬ
	|					втДопНачисления.Сотрудник КАК Сотрудник
	|				ИЗ
	|					втДопНачисления КАК втДопНачисления)) КАК ВКМ_УсловияОплатыСотрудникамСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДопНачисления.ПериодРегистрации КАК ПериодРегистрации,
	|	втДопНачисления.Сотрудник КАК Сотрудник,
	|	втДопНачисления.ВидРасчета КАК ВидРасчета,
	|	ЕСТЬNULL(втВыполненныеРаботы.СуммаКОплатеОборот, 0) * ЕСТЬNULL(втПроцентОтРабот.ПроцентОтРабот, 0) / 100 КАК Сумма
	|ИЗ
	|	втДопНачисления КАК втДопНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ втВыполненныеРаботы КАК втВыполненныеРаботы
	|		ПО втДопНачисления.Сотрудник = втВыполненныеРаботы.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПроцентОтРабот КАК втПроцентОтРабот
	|		ПО втДопНачисления.Сотрудник = втПроцентОтРабот.Сотрудник";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ВидРасчета = ВидРасчетаПремия Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru = 'Начисления по виду расчета ""Премия"" нужно производить документом ""Начисление фиксированных премий""'");
			Сообщение.Сообщить();
			Продолжить;
			
		ИначеЕсли Выборка.ВидРасчета = ВидРасчетаПроцентЗаВыполненныеРаботы Тогда
			
			Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, Выборка);
			Движение.Сумма = Выборка.Сумма * ПараметрНДФЛ;
			
			Стр = ТЗ.Добавить();
			ЗаполнитьЗначенияСвойств(Стр, Движение, "Сотрудник, Сумма");
			Стр.Период = Дата;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры // -- Соколовская О.В. 19.09.2026

// ++ Соколовская О.В. 19.09.2026 Начисление зарплаты
Процедура РасчетУдержаний(Знач ПараметрНДФЛ, ТЗ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ВКМ_НачислениеЗаработнойПлатыУдержания.Ссылка.Дата, МЕСЯЦ) КАК ПериодРегистрации,
	|	ВКМ_НачислениеЗаработнойПлатыУдержания.Сотрудник КАК Сотрудник,
	|	ВКМ_НачислениеЗаработнойПлатыУдержания.ВидРасчета КАК ВидРасчета,
	|	ВКМ_НачислениеЗаработнойПлатыУдержания.Сумма * &ПараметрНДФЛ КАК Сумма
	|ИЗ
	|	Документ.ВКМ_НачислениеЗаработнойПлаты.Удержания КАК ВКМ_НачислениеЗаработнойПлатыУдержания
	|ГДЕ
	|	ВКМ_НачислениеЗаработнойПлатыУдержания.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ПараметрНДФЛ", ПараметрНДФЛ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ВКМ_Удержания.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		
		Стр = ТЗ.Добавить();
		Стр.Сотрудник = Движение.Сотрудник;
		Стр.Сумма = -Движение.Сумма;
		Стр.Период = Дата;
	КонецЦикла;

КонецПроцедуры // -- Соколовская О.В. 19.09.2026

#КонецОбласти
