
// ++ Соколовская О.В. 16.09.2026 Массовое создание реализаций
Функция МассовоеСозданиеРеализаций(Период) Экспорт
	
	// получение договоров, действующих в выбранном периоде и наличие созданных Реализаций
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	ДоговорыКонтрагентов.ВКМ_СуммаАбонентскойПлаты КАК СуммаАбонентскойПлаты,
	|	ДоговорыКонтрагентов.Организация КАК Организация,
	|	ДоговорыКонтрагентов.Владелец КАК Контрагент
	|ПОМЕСТИТЬ втДоговоры
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ВКМ_ПериодДействияНачало <= &ПериодДействияНачало
	|	И ДоговорыКонтрагентов.ВКМ_ПериодДействияКонец >= &ПериодДействияКонец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДоговоры.Ссылка КАК Договор,
	|	втДоговоры.Контрагент КАК Контрагент,
	|	втДоговоры.Организация КАК Организация,
	|	втДоговоры.СуммаАбонентскойПлаты КАК СуммаАбонентскойПлаты,
	|	ЕСТЬNULL(РеализацияТоваровУслуг.Ссылка, ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)) КАК Реализация
	|ИЗ
	|	втДоговоры КАК втДоговоры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО втДоговоры.Ссылка = РеализацияТоваровУслуг.Договор
	|			И (РеализацияТоваровУслуг.Дата МЕЖДУ &ПериодДействияНачало И &ПериодДействияКонец)";
	
	Запрос.УстановитьПараметр("ПериодДействияНачало", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("ПериодДействияКонец", КонецМесяца(Период));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// Создание таблицы значений для вывода в табличную часть обработки
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Договор", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	ТЗ.Колонки.Добавить("Реализация", Новый ОписаниеТипов("ДокументСсылка.РеализацияТоваровУслуг"));
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Стр = ТЗ.Добавить();
			Стр.Договор = Выборка.Договор;
			
			// Создание Реализаций для договоров с абонентской платой
			Если Не ЗначениеЗаполнено(Выборка.Реализация) Тогда
				
				НачатьТранзакцию();
				Попытка
					ДокОбъект = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
					ДокОбъект.Дата = ТекущаяДатаСеанса();
					ДокОбъект.Договор = Стр.Договор;
					ДокОбъект.Организация = Выборка.Организация;
					ДокОбъект.Контрагент = Выборка.Контрагент;
					ДокОбъект.ВыполнитьАвтозаполнение(Выборка.СуммаАбонентскойПлаты);
					ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
					ЗафиксироватьТранзакцию();
				Исключение
					ОтменитьТранзакцию();
				КонецПопытки;
				
				Реализация = ДокОбъект.Ссылка;

			Иначе
				
				// Заполнение таблицы созданными ранее документами
				ДокОбъект = Выборка.Реализация.ПолучитьОбъект();
				ДокОбъект.ВыполнитьАвтозаполнение(Выборка.СуммаАбонентскойПлаты);
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
				
				Реализация = Выборка.Реализация;
			КонецЕсли;
			Стр.Реализация = Реализация;
			
		КонецЦикла;
	КонецЕсли;	
	
	Возврат ТЗ;
	
КонецФункции // -- Соколовская О.В. 16.09.2026