
// ++ Соколовская О.В. 19.09.2026 Заполнение графика работы сотрудников
&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
	Сообщить("Обработка завершена!");
КонецПроцедуры // -- Соколовская О.В. 19.09.2026

// ++ Соколовская О.В. 19.09.2026 Заполнение графика работы сотрудников
&НаСервере
Процедура ЗаполнитьНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
    ОбработкаОбъект.ЗаполнитьГрафик(ВыборПериода.ДатаНачала, ВыборПериода.ДатаОкончания, ВыходныеДни);
КонецПроцедуры // -- Соколовская О.В. 19.09.2026
