
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// ++ Соколовская О.В. 13.09.2026 Работа с заявками клиентов
	// Вывести на форму новые реквизиты договора, если вид договора заполнен
	ЭлементПериодДействияНачало = Элементы.Добавить("ПериодДействияНачало", Тип("Полеформы"));
	ЭлементПериодДействияНачало.Заголовок = "Период действия начало";
	ЭлементПериодДействияНачало.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементПериодДействияНачало.ПутьКДанным = "Объект.ВКМ_ПериодДействияНачало";
	ЭлементПериодДействияНачало.Видимость = АбонентскоеОбслуживание(Объект.ВидДоговора);
	
	ЭлементПериодДействияКонец = Элементы.Добавить("ПериодДействияКонец", Тип("Полеформы"));
	ЭлементПериодДействияКонец.Заголовок = "Период действия конец";
	ЭлементПериодДействияКонец.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементПериодДействияКонец.ПутьКДанным = "Объект.ВКМ_ПериодДействияКонец";
	ЭлементПериодДействияКонец.Видимость = АбонентскоеОбслуживание(Объект.ВидДоговора);
	
	ЭлементСуммаАбонентскойПлаты = Элементы.Добавить("СуммаАбонентскойПлаты", Тип("ПолеФормы"));
	ЭлементСуммаАбонентскойПлаты.Заголовок = "Сумма абонентской платы";
	ЭлементСуммаАбонентскойПлаты.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементСуммаАбонентскойПлаты.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	ЭлементСуммаАбонентскойПлаты.Видимость = АбонентскоеОбслуживание(Объект.ВидДоговора);
	
	ЭлементСтоимостьЧасаРаботы = Элементы.Добавить("СтоимостьЧасаРаботы", Тип("ПолеФормы"));
	ЭлементСтоимостьЧасаРаботы.Заголовок = "Стоимость часа работы";
	ЭлементСтоимостьЧасаРаботы.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементСтоимостьЧасаРаботы.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	ЭлементСтоимостьЧасаРаботы.Видимость = АбонентскоеОбслуживание(Объект.ВидДоговора);
	// -- Соколовская О.В. 13.09.2026
	  
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	// ++ Соколовская О.В. 13.09.2026 Работа с заявками клиентов
	// Вывести на форму новые реквизиты договора, если вид договора заполнен
	ВидДоговора = Объект.ВидДоговора;
	
	Элементы.ПериодДействияНачало.Видимость = АбонентскоеОбслуживание(ВидДоговора);
	Элементы.ПериодДействияКонец.Видимость = АбонентскоеОбслуживание(ВидДоговора);
	Элементы.СуммаАбонентскойПлаты.Видимость = АбонентскоеОбслуживание(ВидДоговора);
	Элементы.СтоимостьЧасаРаботы.Видимость = АбонентскоеОбслуживание(ВидДоговора);
	// -- Соколовская О.В. 13.09.2026

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ++ Соколовская О.В. 13.09.2026 Работа с заявками клиентов
//@skip-check module-unused-method
&НаСервереБезКонтекста
Функция АбонентскоеОбслуживание(Знач ВидДоговора)
	
	Возврат ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание;
	
КонецФункции

#КонецОбласти