
// ++ Соколовская О.В. 16.09.2026 Массовое создание реализаций
&НаКлиенте
Процедура Заполнить(Команда)
	
	КоличествоСозданныхДокументов = КоличествоСозданныхДокументов();
	
	ДлительнаяОперация = НачатьВыполнениеНаСервере();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтаФорма);
	ПараметрыОжидания.Интервал = 1;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	
	Сообщение = СтрШаблон(НСтр("ru = 'Создано новых документов: %1'"), КоличествоСозданныхДокументов);
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении", ЭтотОбъект, Сообщение);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	 
КонецПроцедуры // -- Соколовская О.В. 16.09.2026

// ++ Соколовская О.В. 16.09.2026 Массовое создание реализаций
&НаСервере
Функция КоличествоСозданныхДокументов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	ДоговорыКонтрагентов.ВКМ_СуммаАбонентскойПлаты КАК СуммаАбонентскойПлаты,
	|	ДоговорыКонтрагентов.Организация КАК Организация,
	|	ДоговорыКонтрагентов.Владелец КАК Контрагент
	|ПОМЕСТИТЬ втДоговоры
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ВКМ_ПериодДействияНачало <= &ПериодДействияНачало
	|	И ДоговорыКонтрагентов.ВКМ_ПериодДействияКонец >= &ПериодДействияКонец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ЕСТЬNULL(РеализацияТоваровУслуг.Ссылка, ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка))) КАК КоличествоСозданныхРеализаций
	|ИЗ
	|	втДоговоры КАК втДоговоры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО втДоговоры.Ссылка = РеализацияТоваровУслуг.Договор
	|			И (РеализацияТоваровУслуг.Дата МЕЖДУ &ПериодДействияНачало И &ПериодДействияКонец)
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка ЕСТЬ NULL";	
	
	Запрос.УстановитьПараметр("ПериодДействияНачало", НачалоМесяца(Объект.Период));
	Запрос.УстановитьПараметр("ПериодДействияКонец", КонецМесяца(Объект.Период));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.КоличествоСозданныхРеализаций, 0);

КонецФункции // -- Соколовская О.В. 16.09.2026

// ++ Соколовская О.В. 16.09.2026 Массовое создание реализаций
&НаСервере
Функция  НачатьВыполнениеНаСервере()
	
	Дат = Объект.Период;
	Результат = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, 
			"Обработки.ВКМ_МассовоеСозданиеАктов.МассовоеСозданиеРеализаций", Дат);
	ТЗ =  ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	
	
	Объект.СписокРеализаций.Загрузить(ТЗ);
	
	Возврат Результат;
	
КонецФункции // -- Соколовская О.В. 16.09.2026

// ++ Соколовская О.В. 16.09.2026 Массовое создание реализаций
&НаКлиенте
Процедура ОповещениеОЗавершении(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Статус = "Выполнено" Тогда
		Сообщить(ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры // -- Соколовская О.В. 16.09.2026